# Brewfile — managed by chezmoi. Regenerate base with: brew bundle dump
# Runtime versions (go/node/python/etc.) are managed by mise, not brew.

tap "cameroncooke/axe"
tap "cargo-lambda/cargo-lambda"
tap "charmbracelet/tap"
tap "cormacrelf/tap"
tap "equinix/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "krzko/tap"
tap "mcrich23/formulae"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "pulumi/tap"
tap "restatedev/tap"
tap "ruimarinho/tap"
tap "rwx-cloud/tap"
tap "terraform-linters/tap"
tap "tilt-dev/tap"
tap "withgraphite/tap"
tap "wix/brew"
tap "ymtdzzz/tap"

brew "act"
brew "asc"
brew "ast-grep"
brew "autojump"
brew "aws-sam-cli"
brew "awscli"
brew "bat"
brew "boost"
brew "btop"
brew "ccache"
brew "cffi"
brew "chezmoi"
brew "circleci"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "cryptography"
brew "curl"
brew "d2"
brew "direnv"
brew "doctl"
brew "duckdb"
brew "edencommon"
brew "fb303"
brew "fbthrift"
brew "ffmpeg"
brew "fizz"
brew "flyctl"
brew "folly"
brew "fzf"
brew "gettext"
brew "gh"
brew "git"
brew "glib"
brew "go"
brew "golangci-lint"
brew "goreleaser", link: false
brew "gradle"
brew "graphviz"
brew "harfbuzz"
brew "helm"
brew "hf"
brew "httpie"
brew "jq"
brew "jupyterlab"
brew "k3d"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "lefthook"
brew "libass"
brew "llama.cpp"
brew "llvm"
brew "mas"
brew "maven"
brew "minikube"
brew "mise"
brew "mkcert"
brew "mlx-lm"
brew "mysql"
brew "mysql-client"
brew "ninja"
brew "node"
brew "oauth2l"
brew "openjdk"
brew "openssl@3"
brew "opentofu"
brew "pipx"
brew "pnpm", link: false
brew "poetry"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-grpc-swift"
brew "pycparser"
brew "python@3.11"
brew "python@3.12"
brew "redis"
brew "ripgrep"
brew "starship"
brew "swift-protobuf"
brew "talosctl"
brew "terminal-notifier"
brew "tmux"
brew "tmuxinator"
brew "uv"
brew "wangle"
brew "watchman"
brew "websocat"
brew "wget"
brew "xcode-build-server"
brew "yarn"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password-cli"
cask "blender"
cask "chatgpt"
cask "claude"
cask "codex"
cask "copilot-cli"
cask "discord"
cask "figma"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "goreleaser/tap/goreleaser"
cask "granola"
cask "halloy"
cask "httpie"
cask "jupyter-notebook-viewer"
cask "kaleidoscope"
cask "linear"
cask "ngrok"
cask "notion"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "proxyman"
cask "signal"
cask "superwhisper"
cask "tableplus"
cask "tailscale-app"
cask "temurin"
cask "terraform-linters/tap/tflint"
cask "zed"

mas "1Password for Safari", id: 1569813296
mas "Base 2", id: 6744867438
mas "Brother iPrint&Scan", id: 1193539993
mas "DaisyDisk", id: 411643860
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 6475002485
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
mas "iMovie", id: 408981434
mas "keymapp", id: 6472865291
mas "reMarkable", id: 1276493162
