# Brewfile — managed by chezmoi. Regenerate base with: brew bundle dump
# Runtime versions (go/node/python/etc.) are managed by mise, not brew.

tap "anomalyco/tap"
tap "cameroncooke/axe"
tap "cargo-lambda/cargo-lambda"
tap "charmbracelet/tap"
tap "cormacrelf/tap"
tap "deskflow/tap"
tap "equinix/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hudochenkov/sshpass"
tap "krzko/tap"
tap "mcrich23/formulae"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "pulumi/tap"
tap "restatedev/tap"
tap "ruimarinho/tap"
tap "rwx-cloud/tap"
tap "terraform-linters/tap"
tap "tilt-dev/tap"
tap "withgraphite/tap"
tap "wix/brew"
tap "ymtdzzz/tap"

brew "act"
brew "asc"
brew "ast-grep"
brew "autojump"
brew "aws-sam-cli"
brew "awscli"
brew "bat"
brew "boost"
brew "btop"
brew "ccache"
brew "cffi"
brew "chezmoi"
brew "circleci"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "cryptography"
brew "curl"
brew "d2"
brew "deno"
brew "direnv"
brew "doctl"
brew "duckdb"
brew "edencommon"
brew "fb303"
brew "fbthrift"
brew "ffmpeg"
brew "fizz"
brew "flyctl"
brew "folly"
brew "fzf"
brew "gettext"
brew "gh"
brew "git"
brew "glib"
brew "go"
brew "golangci-lint"
brew "goreleaser", link: false
brew "gradle"
brew "graphviz"
brew "harfbuzz"
brew "helm"
brew "hf"
brew "httpie"
brew "jq"
brew "jupyterlab"
brew "k3d"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "lefthook"
brew "libass"
brew "llama.cpp"
brew "llvm"
brew "mas"
brew "maven"
brew "minikube"
brew "mise"
brew "mkcert"
brew "mlx-lm"
brew "mysql"
brew "mysql-client"
brew "ninja"
brew "node"
brew "oauth2l"
brew "openjdk"
brew "openssl@3"
brew "opentofu"
brew "pipx"
brew "pnpm", link: false
brew "poetry"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-grpc-swift"
brew "pycparser"
brew "python@3.11"
brew "python@3.12"
brew "redis"
brew "ripgrep"
brew "starship"
brew "swift-protobuf"
brew "talosctl"
brew "terminal-notifier"
brew "tmux"
brew "tmuxinator"
brew "uv"
brew "wangle"
brew "watchman"
brew "websocat"
brew "wget"
brew "xcode-build-server"
brew "yarn"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password-cli"
cask "arc"
cask "blender"
cask "block-goose"
cask "chatgpt"
cask "claude"
cask "codex"
cask "copilot-cli"
cask "cursor"
cask "deskflow/tap/deskflow"
cask "discord"
cask "figma"
cask "firefox"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "github-copilot-for-xcode"
cask "google-chrome"
cask "goreleaser/tap/goreleaser"
cask "granola"
cask "halloy"
cask "httpie"
cask "jupyter-notebook-viewer"
cask "kaleidoscope"
cask "linear"
cask "linearmouse"
cask "ngrok"
cask "notion"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "proxyman"
cask "quip"
cask "raycast"
cask "signal"
cask "superwhisper"
cask "tableplus"
cask "tailscale-app"
cask "temurin"
cask "terraform-linters/tap/tflint"
cask "unnaturalscrollwheels"
cask "visual-studio-code"
cask "warp"
cask "zed"

mas "1Password for Safari", id: 1569813296
mas "Aeronaut", id: 6670275450
mas "Base 2", id: 6744867438
mas "Brother iPrint&Scan", id: 1193539993
mas "DaisyDisk", id: 411643860
mas "GarageBand", id: 682658836
mas "Ivory", id: 6444602274
mas "Keynote", id: 361285480
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 6475002485
mas "Soulver 3", id: 1508732804
mas "Things", id: 904280696
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
mas "iMovie", id: 408981434
mas "keymapp", id: 6472865291
mas "reMarkable", id: 1276493162
mas "uBlock Origin Lite", id: 6745342698

vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "drblury.protobuf-vsc"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "gamunu.vscode-yarn"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "houkanshan.vscode-markdown-footnote"
vscode "jinliming2.vscode-go-template"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.wordcount"
vscode "orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "tilt-dev.tiltfile"
vscode "yzhang.markdown-all-in-one"

