tap "homebrew/bundle"
tap "homebrew/services"
tap "ymtdzzz/tap"
brew "bat"
brew "chezmoi"
brew "coreutils"
brew "direnv"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "httpie"
brew "jq"
brew "go"
brew "micro"
brew "node"
brew "pnpm"
brew "protobuf"
brew "redis"
brew "sshpass"
brew "uv"
brew "websocat"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "ymtdzzz/tap/otel-tui"
cask "1password-cli"
cask "font-meslo-lg-nerd-font"
cask "visual-studio-code"
cask "ghostty"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "continue.continue"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "houkanshan.vscode-markdown-footnote"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.wordcount"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "stkb.rewrap"
vscode "tamasfe.even-better-toml"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
